IdeaRS.OpenModel.Parameters.AnchorType
Defines a type of anchor end.

IdeaRS.OpenModel.Parameters.AnchorType.Straight
Straight end - no washer.

IdeaRS.OpenModel.Parameters.AnchorType.WasherPlateCircular
Circular washer plate.

IdeaRS.OpenModel.Parameters.AnchorType.WasherPlateRectangular
Rectangular washer plate.